# Загрузка с посдедующим запуском образа из локального или публичного docker hub
FROM ubuntu:16.04

# Сообщающую Docker автора образа и его email.
# Это полезно, чтобы пользователи образа могли связаться с автором при необходимости.
MAINTAINER Danil Kopylov <lobsterl@yandex.ru>

# Инструкция ENV устанавливает переменные окружения в образе.
# Переменные окружения (environment variable) используются для хранения
# общих значений переменных в пределах разных сценариев и программ.
ENV DIRWWW "/var/www/html"

# Инструкция RUN исполняет команду в конкретном образе при сборке.
# По-умолчанию инструкция RUN исполняется внутри оболочки с использованием обертки команд /bin/sh -c.
RUN apt-get update
RUN ["apt-get", "upgrade", "-y"]

RUN apt-get install -y nginx mc
RUN echo "Danil test docker file in" ${DIRWWW} > ${DIRWWW}/index.html

# Инструкция VOLUME добавляет тома в образ. Том — папка в одном или более контейнерах или папка хоста, проброшенная через Union File System (UFS).
# Тома могут быть расшарены или повторно использованы между контейнерами. Это позволяет добавлять и изменять данные без коммита в образ.
# Чтобы пробросить из хоста в контейтер директорию используете ключ -v /home/danil/Projects/test1/www:/var/www/
#VOLUME ["/var/www/html"]

# Инструкция ADD добавляет файлы или папки из нашего билд-окружения в образ, что полезно например при установке приложения.
# Источником может быть URL, имя файла или директория.
ADD http://wordpress.org/latest.zip ${DIRWWW}

# Инструкция COPY отличается от ADD тем, что предназначена для копирования локальных файлов из билд-контекста и не поддерживает распаковки файлов
COPY ./www/html/info.html ${DIRWWW}


# Открываем порт у докера. Приложение в контейнере должно использовать определенный порт в контейнере.
EXPOSE 80

# Специфицирует пользователя, под которым должен быть запущен образ. Мы можем указать имя пользователя или UID и группу или GID.
# Вы можете перегрузить эту команду, используя глаг -u при запуске контейнера. Если пользователь не указан, используется root по-умолчанию.
USER root

# Инструкция CMD указывает, какую команду необходимо запустить, когда контейнер запущен.
# В отличие от команды RUN указанная команда исполняется не во время построения образа, а во время запуска контейнера.
# Важно помнить, что вы можете перегрузить команду CMD, используя docker run.
#CMD ["/bin/bash"]

#С помощью WORKDIR можно установить рабочую директорию, откуда будут запускаться команды
WORKDIR /usr/sbin

# Часто команду CMD путают с ENTRYPOINT. Разница в том, что вы не можете перегружать ENTRYPOINT при запуске контейнера.
# При запуске контейнера параметры передаются команде, указанной в ENTRYPOINT.
# docker run -d danil/test_web -g "daemon off"
# Можно перегрузить с помощью команды --entrypoint
ENTRYPOINT ["nginx"]

# В этом случае команда в ENTRYPOINT выполнится в любом случае,
# а команда в CMD выполнится, если не передано другой команды при запуске контейнера.
CMD ["-g", "daemon off;"]




